---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemLayoutRule
source: html/e7cc20e1-5039-23a6-109a-72cd1c0d417d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemLayoutRule Property

"Layout Rule"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemLayoutRule { get; }
```